In [1]:
# Code Along Tutorial 
# Dr. Weaver example code 
#

import pandas as pd 
import os

In [2]:
os.getcwd()

'C:\\Users\\josh\\Desktop\\code_alongs-master'

In [3]:
# dataset must be in the local folder based on os 
x = pd.read_csv('titanic_data.csv')

In [4]:
x.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
x.Age.mean()

29.69911764705882

In [6]:
x['Age'].mean()

29.69911764705882

In [7]:
# remove rows with NA values 
# auto_prices.dropna(axis = 0, inplace = True)

x.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [8]:
# Drop rows that contain na values 
# x.dropna(axis = 0, inplace = True)

In [9]:
x.Age.mean()

29.69911764705882

In [10]:
x.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [11]:
# fill columns with missing values 
#_.fillna()
x.Age.fillna(x.Age.mean(), inplace = True )

In [12]:
x.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [13]:
x.drop(columns = 'Cabin', inplace = True)

In [14]:
x.shape

(891, 11)

In [15]:
#fill missing values for Age with the median age 
#titanic.Age.fillna(titanic.Age.median(), inplace=True)
#the 'inplace=True' means the dataframe is changed, and this change is persisted

In [16]:
x.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [17]:
# .value_counts(dropna = False )
# important so that pandas gives you a sum of na values

x.Embarked.value_counts(dropna = False)

S      644
C      168
Q       77
NaN      2
Name: Embarked, dtype: int64

In [18]:
# subsetting 
x[x['Embarked'] == 'S'].head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,S

In [19]:
# subsetting by the null columns
x[x["Embarked"].isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,NaN

In [20]:
# create dummy variables 
# this create numeric values for categorical features 
# scikit learn only works with numberic values, will not work with categorical string values

dummies = pd.get_dummies(x['Embarked'], prefix = 'dummies')

In [21]:
x.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,S

In [22]:
# add dummies in one call 
x = pd.concat([x, (pd.get_dummies(x['Embarked'], prefix = 'dummies'))], axis = 1)

In [23]:
# shape of data frame 
x.shape

(891, 14)

In [24]:
# count the number of columns 
len(x.columns)

14

In [25]:
# drop columns by column name 
#x = x.drop(columns = ['date_collection_1998',
#                               'age_in_years', 'age_category'])

In [30]:
# drop columns by slicing 
x = x.drop(columns = x.columns[3:], axis = 1)

In [31]:
x

     PassengerId  Survived  Pclass
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
5              6         0       3
6              7         0       1
7              8         0       3
8              9         1       3
9             10         1       2
10            11         1       3
11            12         1       1
12            13         0       3
13            14         0       3
14            15         0       3
15            16         1       2
16            17         0       3
17            18         1       2
18            19         0       3
19            20         1       3
20            21         0       2
21            22         1       2
22            23         1       3
23            24         1       1
24            25         0       3
25            26         1       3
26            27         0       3
27            28         0       1
28            29         1       3
29            30         0       3
..           ...       ...     ...
861          862         0       2
862          863         1       1
863          864         0       3
864          865         0       2
865          866         1       2
866          867         1       2
867          868         0       1
868          869         0       3
869          870         1       3
870          871         0       3
871          872         1       1
872          873         0       1
873          874         0       3
874          875         1       2
875          876         1       3
876          877         0       3
877          878         0       3
878          879         0       3
879          880         1       1
880          881         1       2
881          882         0       3
882          883         0       3
883          884         0       2
884          885         0       3
885          886         0       3
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

[891 rows x 3 columns]

In [28]:
x.shape

(891, 14)

In [29]:
x.columns[3:5]

Index(['Name', 'Sex'], dtype='object')

In [13]:
from sklearn.datasets import load_iris
i = load_iris()

In [14]:
import pandas as pd

In [12]:
i

   0
0  a
1  b
2  c